In [264]:
#Importamos las librerías necesarias
import pandas as pd
import numpy as np

Limpieza de datos del dataset "tasa_desempleo_Canada"

In [265]:
#Cargamos el dataset
desempleo = pd.read_csv("data/tasa_desemplo_Canada.csv",  sep=",", skiprows=8, index_col=0)

In [266]:
# Lee el archivo CSV sin establecer un índice personalizado
desempleo = pd.read_csv("data/tasa_desemplo_Canada.csv", sep=",", skiprows=8, header=None)

# Establece la primera fila como nombres de columna y elimina la fila original
desempleo.columns = desempleo.iloc[0]
desempleo = desempleo[1:]

# Restablece el índice a cero
desempleo.reset_index(drop=True, inplace=True)

In [297]:
# Rellena los valores NaN en la columna 'Geography' usando forward fill (ffill)
desempleo['Geography'].fillna(method='ffill', inplace=True)

In [298]:
# Elimina el número "6" de la columna 'Geography'
desempleo['Geography'] = desempleo['Geography'].str.replace('6', '').str.strip()

In [270]:
# Función para convertir nombres a enteros si son numéricos
def convertir_a_entero(nombre):
    try:
        return str(int(float(nombre)))
    except:
        return nombre

desempleo.columns = [convertir_a_entero(nombre) for nombre in desempleo.columns]

# Imprime el DataFrame actualizado
desempleo.head(10)

,Geography,Educational attainment,2018,Symbol,2019,Symbol,2020,Symbol,2021,Symbol,2022,Symbol
0,Canada,All levels of education,6.2,A,6.3,A,10.7,A,8.0,A,5.6,A
1,Canada,Less than high school 7,11.2,B,12.3,B,17.7,B,14.6,B,12.3,B
2,Canada,High school 8,8.0,B,8.7,B,14.8,A,12.0,B,7.9,B
3,Canada,College or trade 9,5.3,B,5.2,B,10.0,A,7.3,B,4.4,B
4,Canada,University 10,5.4,B,5.2,B,8.5,B,6.1,B,4.9,B
5,Newfoundland and Labrador,All levels of education,14.2,B,14.3,B,14.0,B,11.9,B,8.3,B
6,Newfoundland and Labrador,Less than high school 7,NaN,x,NaN,x,NaN,x,NaN,x,NaN,x
7,Newfoundland and Labrador,High school 8,14.8,C,18.0,C,17.1,C,20.4,C,11.7,C
8,Newfoundland and Labrador,College or trade 9,17.7,B,15.2,C,15.4,B,10.1,C,7.6,C
9,Newfoundland and Labrador,University 10,NaN,x,9.5,C,NaN,x,NaN,x,NaN,x

In [300]:
# Elimina los números al final de los valores en la columna 'Educational attainment'
desempleo['Educational attainment'] = desempleo['Educational attainment'].str.replace(r'\d+$', '', regex=True)

In [301]:
# Eliminar todas las filas desde la fila 55 hacia abajo
desempleo = desempleo.iloc[:55]

In [275]:
# Reemplazar NaN por 0 en las columnas numéricas
columnas_numericas = desempleo.select_dtypes(include=[np.number])
desempleo[columnas_numericas.columns] = columnas_numericas.fillna(0)

In [294]:
desempleo = desempleo.drop(columns=["Symbol"])

In [295]:
desempleo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Geography               55 non-null     object
 1   Educational attainment  55 non-null     object
 2   2018                    55 non-null     float64
 3   2019                    55 non-null     float64
 4   2020                    55 non-null     float64
 5   2021                    55 non-null     float64
 6   2022                    55 non-null     float64
dtypes: float64(5), object(2)
memory usage: 3.1+ KB

    Limpieza de datos del dataset "after_graduate"

In [279]:
#Cargamos el dataset

# Ruta del archivo CSV
archivo_csv = "data/after_graduate.csv"

# Cargar el archivo CSV en un DataFrame
after_graduate = pd.read_csv(archivo_csv, sep=";")  # Usar "\t" como separador si los datos están tabulados

# Imprimir el DataFrame
after_graduate

,Educational qualification 10,Field of study,2019,2021
0,"Career, technical or professional training cer...","Total, field of study","35,580","36,800"
1,NaN,Education,"1,040","31,100"
2,NaN,"Visual and performing arts, and communications...","1,220","22,700"
3,NaN,Humanities,"1,760","24,400"
4,NaN,Social and behavioural sciences and law,"1,970","37,600"
...,...,...,...,...
73,NaN,"Architecture, engineering, and related technol...","1,330","78,900"
74,NaN,"Agriculture, natural resources and conservation",210,"61,700"
75,NaN,Health and related fields,620,"78,000"
76,NaN,"Personal, protective and transportation services",0,NaN
77,NaN,Other instructional programs,80,"74,000"

In [303]:
# Cambiar el nombre de la columna "2019" a "Number_graduates_2019"
after_graduate= after_graduate.rename(columns={"2019": "Número_graduados_2019"})

# Cambiar el nombre de la columna "2021" a "Ingreso_medio_por_empleo"
after_graduate = after_graduate.rename(columns={"2021": "Ingreso_medio_por_empleo"})

# Cambiar el nombre de la columna "Educational qualification 10" a "Nivel_educativo"
after_graduate = after_graduate.rename(columns={"Educational qualification 10": "Nivel_educativo"})

# Cambiar el nombre de la columna "Field of study"" a "Campo de estudio"
after_graduate = after_graduate.rename(columns={"Field of study": "Campo de estudio"})

In [282]:
# Rellena los valores NaN en la columna 'Nivel_educativo' usando forward fill (ffill)
after_graduate['Nivel_educativo'].fillna(method='ffill', inplace=True)

In [284]:
after_graduate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 4 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Nivel_educativo           78 non-null     object
 1   Campo de estudio          78 non-null     object
 2   Número_graduados_2019     67 non-null     object
 3   Ingreso_medio_por_empleo  65 non-null     object
dtypes: object(4)
memory usage: 2.6+ KB

In [285]:
# Eliminar todas las filas que contienen valores nulos
after_graduate = after_graduate.dropna()

In [286]:
after_graduate.info()

<class 'pandas.core.frame.DataFrame'>
Index: 65 entries, 0 to 77
Data columns (total 4 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Nivel_educativo           65 non-null     object
 1   Campo de estudio          65 non-null     object
 2   Número_graduados_2019     65 non-null     object
 3   Ingreso_medio_por_empleo  65 non-null     object
dtypes: object(4)
memory usage: 2.5+ KB

In [288]:
# Eliminar las comas y convertir la columna "Número_graduados_2019" a entero
after_graduate['Número_graduados_2019'] = after_graduate['Número_graduados_2019'].str.replace(',', '', regex=True).astype(int)

# Eliminar las comas y convertir la columna "Ingreso_medio_por_empleo" a entero
after_graduate['Ingreso_medio_por_empleo'] = after_graduate['Ingreso_medio_por_empleo'].str.replace(',', '', regex=True).astype(int)

In [289]:
after_graduate["Nivel_educativo"].value_counts()

Nivel_educativo
Career, technical or professional training diploma        13
Undergraduate degree                                      13
Master's degree                                           13
Doctoral degree                                           12
Career, technical or professional training certificate    11
Professional degree                                        3
Name: count, dtype: int64

In [290]:
after_graduate.info()

<class 'pandas.core.frame.DataFrame'>
Index: 65 entries, 0 to 77
Data columns (total 4 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Nivel_educativo           65 non-null     object
 1   Campo de estudio          65 non-null     object
 2   Número_graduados_2019     65 non-null     int32
 3   Ingreso_medio_por_empleo  65 non-null     int32
dtypes: int32(2), object(2)
memory usage: 2.0+ KB

In [291]:
after_graduate.head(5)

,Nivel_educativo,Campo de estudio,Número_graduados_2019,Ingreso_medio_por_empleo
0,"Career, technical or professional training cer...","Total, field of study",35580,36800
1,"Career, technical or professional training cer...",Education,1040,31100
2,"Career, technical or professional training cer...","Visual and performing arts, and communications...",1220,22700
3,"Career, technical or professional training cer...",Humanities,1760,24400
4,"Career, technical or professional training cer...",Social and behavioural sciences and law,1970,37600

In [296]:
#Exportamos el archivo limpio para realizarle el EDA
ruta_archivo = "data/desempleo_Canada.csv"  # Ruta completa al archivo CSV

desempleo.to_csv(ruta_archivo, index=False)

In [293]:
#Exportamos el archivo limpio para realizarle el EDA
ruta_archivo = "data/after_graduate_Canada.csv"  # Ruta completa al archivo CSV

after_graduate.to_csv(ruta_archivo, index=False)